<?php 

/* 
	设计模式的作用分为3大类：

	创建型
	结构型
	行为型

	创建型模式
	是用来创建对象的模式，这些模式是对实例化过程的抽象。

	结构型模式
	这些模式所关心的是组合结构应当保证结构化。结构型类模式采用继承来组合
	接口或实现。结构型对象模式则描述了组合对象来建立新功能的方法。

	行为型模式
	绝大多数模式都是行为型对象。这些模式的核心是算法和对象之间职责的分配。
	它们不只是对象或类的模式，它们还描述了类和对象之间的通信模式。


	【 九大设计模式 】
	创建型    类    工厂方法   实例化对象的子类
			  对象  原型       实例化对象的类

	结构型    类    适配器     对象的接口
	          对象  适配器     对象的职责而不派生子类
	          		装饰器

	行为型    类    模板方法   算法中的步骤
			  对象  状态       对象状态
			  对象  策略       算法
			  对象  职责链     可以满足请求的对象
			  对象  观察者     依赖于其他对象的对象数；当前可以有多少个
			                   依赖对象
	


	*/

