[ 字符串函数 ]
表：
char_length(s)						返回字符串s的字符数
length(s)							返回字符串s的长度
concat(s1,s2,...) 					将字符串s1，s2等多个字符串合并为一个字符串
concat_ws(x,s1,s2,...)				同concat(s1，s2,...)函数，但是每个字符串直接要加上x
insert(s1,x,len,s2)					将字符串s2替换s1的x位置开始长度为len的字符串
upper(s),ucase(s)					将字符串s的所有字母都变成大写字母
lower(s),lcase(s)					将字符串s的所有字母都变成小写字母
left(s,n)							返回字符串s的前n个字符
right(s,n)							返回字符串s的后n个字符
lpad(s1,len,s2)						字符串s2来填充s1的开始处，使字符串长度达到len
rpad(s1,len,s2)						字符串s2来填充s1的结尾处，使字符串长度达到len
ltrim(s)							去掉字符串s开始处的空格
rtrim(s)							去掉字符串s结尾处的空格
trim(s)								去掉字符串s开始处和结尾处的空格
trim(s1 from s)						去掉字符串s中开始处和结尾处的字符串s1
repeat(s,n)							将字符串s重复n次
space(n)							返回n个空格
replace(s,s1,s2)					用字符串s2替换字符串s中的字符串s1
strcmp(s1,s2)						比较字符串s1和s2
substring(s,n,len)					获取从字符串s中的第n个位置开始长度为len的字符串
mid(s,n,len)						同substring(s,n,len)
locate(s1,s),position(s1 in s)		从字符串s中获取s1的开始位置
instr(s,s1)							从字符串s中获取s1的开始位置
reverse(s)							将字符串s的顺序反过来
elt(n,s1,s2,...)					返回第n个字符串
export_set(b,s1,s2[,s,len])			按b的二进制  s是分隔符 len总长度 合并s1,s2
field(s,s1,s2,...)					返回第一个与字符串s匹配的字符串的位置
find_in_set(s1,s2)					返回在字符串s2中与s1匹配的字符串的位置
make_set(x,s1,s2)					按x的二进制数从s1,s2,...，sn中选取字符串


[例1] select s,char_length(s),length(s) from t2;
+---------+----------------+-----------+
| s       | char_length(s) | length(s) |
+---------+----------------+-----------+
| beijing |              7 |         7 |
+---------+----------------+-----------+

[例2]  select concat('bei','ji','ng'),concat_ws('-','bei','ji','ng');
+-------------------------+--------------------------------+
| concat('bei','ji','ng') | concat_ws('-','bei','ji','ng') |
+-------------------------+--------------------------------+
| beijing                 | bei-ji-ng                      |
+-------------------------+--------------------------------+

[例3] select 'abc',insert('abc',2,0,'ddd');
+-----+-------------------------+
| abc | insert('abc',2,0,'ddd') |
+-----+-------------------------+
| abc | adddbc                  |
+-----+-------------------------+

[例4] select s,insert(s,4,4,'fang') from t2;
+---------+----------------------+
| s       | insert(s,4,4,'fang') |
+---------+----------------------+
| beijing | beifang              |
+---------+----------------------+

[例5] select upper('mysql'),ucase('mysql'),lower('MYSQL'),lcase('MYSQL');
+----------------+----------------+----------------+----------------+
| upper('mysql') | ucase('mysql') | lower('MYSQL') | lcase('MYSQL') |
+----------------+----------------+----------------+----------------+
| MYSQL          | MYSQL          | mysql          | mysql          |
+----------------+----------------+----------------+----------------+

[例6] select 'abc',left('abc',2),right('abc',2);
+-----+---------------+----------------+
| abc | left('abc',2) | right('abc',2) |
+-----+---------------+----------------+
| abc | ab            | bc             |
+-----+---------------+----------------+

[例7] select 'abc',lpad('abc',10,'+-'),rpad('abc',10,'+-');
+-----+---------------------+---------------------+
| abc | lpad('abc',10,'+-') | rpad('abc',10,'+-') |
+-----+---------------------+---------------------+
| abc | +-+-+-+abc          | abc+-+-+-+          |
+-----+---------------------+---------------------+

[例8] select concat('+',' me ','+'),concat('+',ltrim(' m '),'+');
+------------------------+------------------------------+
| concat('+',' me ','+') | concat('+',ltrim(' m '),'+') |
+------------------------+------------------------------+
| + me +                 | +m +                         |
+------------------------+------------------------------+

[例9] select concat('+',' me ','+'),concat('+',rtrim(' m '), '+');
+------------------------+-------------------------------+
| concat('+',' me ','+') | concat('+',rtrim(' m '), '+') |
+------------------------+-------------------------------+
| + me +                 | + m+                          |
+------------------------+-------------------------------+

[例10] select concat('+', ' m ', '+'), concat('+', trim(' m '), '+');
+-------------------------+-------------------------------+
| concat('+', ' m ', '+') | concat('+', trim(' m '), '+') |
+-------------------------+-------------------------------+
| + m +                   | +m+                           |
+-------------------------+-------------------------------+

[例11] select trim('ab' from 'ababddddabddab');
+----------------------------------+
| trim('ab' from 'ababddddabddab') |
+----------------------------------+
| ddddabdd                         |
+----------------------------------+
[例12] select repeat('mysql-',2);
+--------------------+
| repeat('mysql-',2) |
+--------------------+
| mysql-mysql-       |
+--------------------+

[例13] select concat('+',space(4),'+'),replace('mysql','sql','book');
+--------------------------+-------------------------------+
| concat('+',space(4),'+') | replace('mysql','sql','book') |
+--------------------------+-------------------------------+
| +    +                   | mybook                        |
+--------------------------+-------------------------------+

[例14] select strcmp('abc','abb'),strcmp('abc','abc'),strcmp('abc','abd');             +---------------------+---------------------+---------------------+
| strcmp('abc','abb') | strcmp('abc','abc') | strcmp('abc','abd') |
+---------------------+---------------------+---------------------+
|                   1 |                   0 |                  -1 |
+---------------------+---------------------+---------------------+

[例15] select 'abc',substring('abc',2,2),mid('abc',2,2);
+-----+----------------------+----------------+
| abc | substring('abc',2,2) | mid('abc',2,2) |
+-----+----------------------+----------------+
| abc | bc                   | bc             |
+-----+----------------------+----------------+

[例16] select 'beijing',locate('jin','beijing'),instr('beijing','jin'); 
+---------+-------------------------+------------------------+
| beijing | locate('jin','beijing') | instr('beijing','jin') |
+---------+-------------------------+------------------------+
| beijing |                       4 |                      4 |
+---------+-------------------------+------------------------+

[例17] select 'beijing', reverse('beijing');
+---------+--------------------+
| beijing | reverse('beijing') |
+---------+--------------------+
| beijing | gnijieb            |
+---------+--------------------+

[例18] select elt(2,'me','my','he','she');
+-----------------------------+
| elt(2,'me','my','he','she') |
+-----------------------------+
| my                          |
+-----------------------------+

[例19] select field('he','me','my','he','she');
+----------------------------------+
| field('he','me','my','he','she') |
+----------------------------------+
|                                3 |
+----------------------------------+

[例20] select find_in_set('like','i,like,bei,jing');
+---------------------------------------+
| find_in_set('like','i,like,bei,jing') |
+---------------------------------------+
|                                     2 |
+---------------------------------------+

[例21] select make_set(11,'a','b','c','d'), make_set(7,'a','b','c','d');
+------------------------------+-----------------------------+
| make_set(11,'a','b','c','d') | make_set(7,'a','b','c','d') |
+------------------------------+-----------------------------+
| a,b,d                        | a,b,c                       |
+------------------------------+-----------------------------+
