[ 日期和时间函数 ]

表：
curdate(),current_date()			返回当前日期
curtime(),current_time()			返回当前时间

now(),current_timestamp(),
localtime(),sysdate(),				返回当前日期和时间
localtimestamp()	

unix_timestamp()					以unix时间戳的形式返回当前时间
unix_timestamp(d)					把unix时间戳的时间转换为普通格式的时间
utc_date()							返回utc(Universal Coordinated Time,国际协调时间）
utc_time()							返回utc时间
month(d)							返回日期d中的月份值，范围是1-12
monthname(d)						返回日期d中的月份名称
dayname(d)							返回日期d是星期几，名称
dayofweek(d)						返回日期d是星期几，1：星期日，2：星期一
weekday(d)							返回日期d是星期几，0：星期一，1：星期二
week(d)								计算日期d是本年的第几个星期，范围是0-53
weekofyear(d)						计算日期d是本年的第几个星期，范围是1-53
dayofyear(d)						计算日期d是本年的第几天
dayofmonth(d)						计算日期d是本月的第几天
year(d)								返回日期d中的年份值
quarter(d)							返回日期d是第几季度，范围是1-4
hour(t)								返回时间t中的小时值
minute(t)							返回时间t中的分钟值
second(t)							返回时间t中的秒钟值
extract(type from d)				从日期d中获取指定的值，type指定返回的值，如year,hour等
time_to_sec(t)						将以秒为单位的时间s转换为时分秒的格式
to_days(d)							计算日期d-0000年1月1日的天数
from_days(n)						计算从0000年1月1日开始n天后的日期
datediff(d1,d2)						计算日期d1-d2之间相隔的天数
adddate(d,n)						计算起始日期d加上n天的日期
adddate(d,interval expr type)		计算起始日期d加上一个时间段后的日期
date_add(d,interval expr type)		同adddate(d,interval expr type)
subdate(d,n)						计算起始日期d减去n天的日期
subdate(d, interval expr type)		计算起始日期d减去一个时间段后的日期
addtime(t,n)						计算起始时间t加上n秒的时间
subtime(t,n)						计算起始时间t减去n秒的时间
date_format(d,f)					按照表达式f的要求显示日期d
time_format(t,f)					按照表达式f的要求显示时间t
get_format(type,s)					根据字符串s获取type类型数据的显示格式
from_unixtime(t)					将unix格式的时间戳转成普通格式的时间

[例1] select curdate(),current_date(),curtime(),current_time();
+------------+----------------+-----------+----------------+
| curdate()  | current_date() | curtime() | current_time() |
+------------+----------------+-----------+----------------+
| 2017-02-07 | 2017-02-07     | 14:51:33  | 14:51:33       |
+------------+----------------+-----------+----------------+

[例2] select now(),current_timestamp(),localtime(),sysdate();
+---------------------+---------------------+---------------------+---------------------+
| now()               | current_timestamp() | localtime()         | sysdate()           |
+---------------------+---------------------+---------------------+---------------------+
| 2017-02-07 14:54:11 | 2017-02-07 14:54:11 | 2017-02-07 14:54:11 | 2017-02-07 14:54:11 |
+---------------------+---------------------+---------------------+---------------------+

[例3] select now(),unix_timestamp(),unix_timestamp(now());
+---------------------+------------------+-----------------------+
| now()               | unix_timestamp() | unix_timestamp(now()) |
+---------------------+------------------+-----------------------+
| 2017-02-07 14:56:19 |       1486450579 |            1486450579 |
+---------------------+------------------+-----------------------+

[例4] select now(),unix_timestamp(),from_unixtime(unix_timestamp());
+---------------------+------------------+---------------------------------+
| now()               | unix_timestamp() | from_unixtime(unix_timestamp()) |
+---------------------+------------------+---------------------------------+
| 2017-02-07 14:58:56 |       1486450736 | 2017-02-07 14:58:56             |
+---------------------+------------------+---------------------------------+

[例5] select curdate(),utc_date(),curtime(),utc_time();
+------------+------------+-----------+------------+
| curdate()  | utc_date() | curtime() | utc_time() |
+------------+------------+-----------+------------+
| 2017-02-07 | 2017-02-07 | 15:00:08  | 07:00:08   |
+------------+------------+-----------+------------+

[例6] select now(),month(now()),monthname(now());
+---------------------+--------------+------------------+
| now()               | month(now()) | monthname(now()) |
+---------------------+--------------+------------------+
| 2017-02-07 15:01:13 |            2 | February         |
+---------------------+--------------+------------------+

[例7] select now(),month(now()),monthname(now());
+---------------------+--------------+------------------+
| now()               | month(now()) | monthname(now()) |
+---------------------+--------------+------------------+
| 2017-02-07 15:01:13 |            2 | February         |
+---------------------+--------------+------------------+

[例8] select curdate(),dayname(curdate()),dayofweek(curdate()),weekday(curdate());        +------------+--------------------+----------------------+--------------------+
| curdate()  | dayname(curdate()) | dayofweek(curdate()) | weekday(curdate()) |
+------------+--------------------+----------------------+--------------------+
| 2017-02-07 | Tuesday            |                    3 |                  1 |
+------------+--------------------+----------------------+--------------------+

[例9] select curdate(),week(curdate()),weekofyear(curdate()),now(),week(now()),weekofyear(now());
+------------+-----------------+-----------------------+---------------------+-------------+-------------------+
| curdate()  | week(curdate()) | weekofyear(curdate()) | now()               | week(now()) | weekofyear(now()) |
+------------+-----------------+-----------------------+---------------------+-------------+-------------------+
| 2017-02-07 |               6 |                     6 | 2017-02-07 15:09:10 |           6 |                 6 |
+------------+-----------------+-----------------------+---------------------+-------------+-------------------+

[例10] select curdate(),dayofyear(curdate()),dayofmonth(curdate());
+------------+----------------------+-----------------------+
| curdate()  | dayofyear(curdate()) | dayofmonth(curdate()) |
+------------+----------------------+-----------------------+
| 2017-02-07 |                   38 |                     7 |
+------------+----------------------+-----------------------+

[例11] select curdate(),dayofyear(curdate()),dayofmonth(curdate());
+------------+----------------------+-----------------------+
| curdate()  | dayofyear(curdate()) | dayofmonth(curdate()) |
+------------+----------------------+-----------------------+
| 2017-02-07 |                   38 |                     7 |
+------------+----------------------+-----------------------+

[例12] select curtime(),hour(curtime()),minute(curtime()),second(curtime());
+-----------+-----------------+-------------------+-------------------+
| curtime() | hour(curtime()) | minute(curtime()) | second(curtime()) |
+-----------+-----------------+-------------------+-------------------+
| 15:15:58  |              15 |                15 |                58 |
+-----------+-----------------+-------------------+-------------------+

[例13] select now(),extract(year from now()),extract(minute from now());
+---------------------+--------------------------+----------------------------+
| now()               | extract(year from now()) | extract(minute from now()) |
+---------------------+--------------------------+----------------------------+
| 2017-02-07 15:18:13 |                     2017 |                         18 |
+---------------------+--------------------------+----------------------------+

[例14] select curtime(),time_to_sec(curtime()),sec_to_time(time_to_sec(curtime()));
+-----------+------------------------+-------------------------------------+
| curtime() | time_to_sec(curtime()) | sec_to_time(time_to_sec(curtime())) |
+-----------+------------------------+-------------------------------------+
| 15:20:03  |                  55203 | 15:20:03                            |
+-----------+------------------------+-------------------------------------+

[例15] select curdate(),to_days(curdate()),from_days(to_days(curdate())),datediff(curdate(),'2009-10-24');
+------------+--------------------+-------------------------------+----------------------------------+
| curdate()  | to_days(curdate()) | from_days(to_days(curdate())) | datediff(curdate(),'2009-10-24') |
+------------+--------------------+-------------------------------+----------------------------------+
| 2017-02-07 |             736732 | 2017-02-07                    |                             2663 |
+------------+--------------------+-------------------------------+----------------------------------+

[例16] select curdate(),adddate(curdate(),3),subdate(curdate(),3),addtime(curtime(),5),subtime(curtime(),5);
+------------+----------------------+----------------------+----------------------+----------------------+
| curdate()  | adddate(curdate(),3) | subdate(curdate(),3) | addtime(curtime(),5) | subtime(curtime(),5) |
+------------+----------------------+----------------------+----------------------+----------------------+
| 2017-02-07 | 2017-02-10           | 2017-02-04           | 15:24:55             | 15:24:45             |
+------------+----------------------+----------------------+----------------------+----------------------+

[例17] select now(),adddate(now(),interval '1 1' year_month);
+---------------------+------------------------------------------+
| now()               | adddate(now(),interval '1 1' year_month) |
+---------------------+------------------------------------------+
| 2017-02-07 15:26:55 | 2018-03-07 15:26:55                      |
+---------------------+------------------------------------------+

[例18] select now(),adddate(now(),interval '-1 -1' year_month);
+---------------------+--------------------------------------------+
| now()               | adddate(now(),interval '-1 -1' year_month) |
+---------------------+--------------------------------------------+
| 2017-02-07 15:28:17 | 2016-01-07 15:28:17                        |
+---------------------+--------------------------------------------+

[例19] select curdate(),date_format(curdate(),'%b %D %Y');
+------------+-----------------------------------+
| curdate()  | date_format(curdate(),'%b %D %Y') |
+------------+-----------------------------------+
| 2017-02-07 | Feb 7th 2017                      |
+------------+-----------------------------------+

[例20] select curdate(),date_format(curdate(),'%j') days, date_format(curdate(),'%W') week;
+------------+------+---------+
| curdate()  | days | week    |
+------------+------+---------+
| 2017-02-07 | 038  | Tuesday |
+------------+------+---------+

[例21] select curtime(),time_format(curtime(),'%r');
+-----------+-----------------------------+
| curtime() | time_format(curtime(),'%r') |
+-----------+-----------------------------+
| 15:34:17  | 03:34:17 PM                 |
+-----------+-----------------------------+

[例22] select get_format(datetime,'ISO'),get_format(date,'EUR'),get_format(time,'USA');
+----------------------------+------------------------+------------------------+
| get_format(datetime,'ISO') | get_format(date,'EUR') | get_format(time,'USA') |
+----------------------------+------------------------+------------------------+
| %Y-%m-%d %H:%i:%s          | %d.%m.%Y               | %h:%i:%s %p            |
+----------------------------+------------------------+------------------------+

[例23] select now(),date_format(now(),get_format(datetime,'INTERNAL'));
+---------------------+----------------------------------------------------+
| now()               | date_format(now(),get_format(datetime,'INTERNAL')) |
+---------------------+----------------------------------------------------+
| 2017-02-07 15:52:58 | 20170207155258                                     |
+---------------------+----------------------------------------------------+


[例1] select curdate(),date_format(curdate(),get_format(date,'EUR'));
+------------+-----------------------------------------------+
| curdate()  | date_format(curdate(),get_format(date,'EUR')) |
+------------+-----------------------------------------------+
| 2017-02-07 | 07.02.2017                                    |
+------------+-----------------------------------------------+

